In [17]:
import pandas as pd
import numpy as np
sub=pd.read_csv("subs.csv")
vk=pd.read_csv("kohli_ipl.csv")
movies=pd.read_csv("bollywood.csv")

In [18]:
sub

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [19]:
vk

     match_no  runs
0           1     1
1           2    23
2           3    13
3           4    12
4           5     1
..        ...   ...
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

[215 rows x 2 columns]

In [20]:
movies

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]

1. astype()

In [21]:
import sys
sys.getsizeof(vk)

3604

In [22]:
sys.getsizeof(vk.astype("int16"))

1024

2. between()   -->  deleted function

3. clip()

In [23]:
sub

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [24]:
sub.clip(100,200)

     Subscribers gained
0                   100
1                   100
2                   100
3                   100
4                   100
..                  ...
360                 200
361                 200
362                 155
363                 144
364                 172

[365 rows x 1 columns]

4. drop_duplicates()

In [25]:
temp=pd.Series([1,1,2,2,3,3,4,4,5,5,6,6])
temp

0     1
1     1
2     2
3     2
4     3
5     3
6     4
7     4
8     5
9     5
10    6
11    6
dtype: int64

In [26]:
temp.drop_duplicates()

0     1
2     2
4     3
6     4
8     5
10    6
dtype: int64

In [27]:
temp.drop_duplicates(keep="last")

1     1
3     2
5     3
7     4
9     5
11    6
dtype: int64

In [28]:
movies.drop_duplicates().size

2994

duplicated()

In [29]:
temp.duplicated()

0     False
1      True
2     False
3      True
4     False
5      True
6     False
7      True
8     False
9      True
10    False
11     True
dtype: bool

In [30]:
temp.duplicated().sum()

np.int64(6)

5. isnull

In [31]:
temp2=pd.Series([1,2,3,np.nan,5,6,np.nan,8,np.nan,10])

In [32]:
temp2

0     1.0
1     2.0
2     3.0
3     NaN
4     5.0
5     6.0
6     NaN
7     8.0
8     NaN
9    10.0
dtype: float64

In [33]:
temp2.size

10

In [34]:
temp2.count()

np.int64(7)

In [35]:
temp2.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8     True
9    False
dtype: bool

In [36]:
temp2[temp2.isnull()]

3   NaN
6   NaN
8   NaN
dtype: float64

In [37]:
temp2.isnull().sum()

np.int64(3)

6. dropna()

In [38]:
temp2.dropna()

0     1.0
1     2.0
2     3.0
4     5.0
5     6.0
7     8.0
9    10.0
dtype: float64

7. fillna()

In [39]:
temp2.fillna(0)

0     1.0
1     2.0
2     3.0
3     0.0
4     5.0
5     6.0
6     0.0
7     8.0
8     0.0
9    10.0
dtype: float64

In [40]:
temp2.fillna(temp2.mean())

0     1.0
1     2.0
2     3.0
3     5.0
4     5.0
5     6.0
6     5.0
7     8.0
8     5.0
9    10.0
dtype: float64

8. isin()

In [41]:
# VK outs on 49 or 99
vk[(vk==49) | (vk==99)]

     match_no  runs
0         NaN   NaN
1         NaN   NaN
2         NaN   NaN
3         NaN   NaN
4         NaN   NaN
..        ...   ...
210       NaN   NaN
211       NaN   NaN
212       NaN   NaN
213       NaN   NaN
214       NaN   NaN

[215 rows x 2 columns]

In [42]:
vk[vk.isin([49,99,69,80])]

     match_no  runs
0         NaN   NaN
1         NaN   NaN
2         NaN   NaN
3         NaN   NaN
4         NaN   NaN
..        ...   ...
210       NaN   NaN
211       NaN   NaN
212       NaN   NaN
213       NaN   NaN
214       NaN   NaN

[215 rows x 2 columns]

9. apply()

In [43]:
movies.apply(lambda x: x.str.split())

                                           movie                 lead
0                  [Uri:, The, Surgical, Strike]     [Vicky, Kaushal]
1                               [Battalion, 609]       [Vicky, Ahuja]
2     [The, Accidental, Prime, Minister, (film)]       [Anupam, Kher]
3                            [Why, Cheat, India]     [Emraan, Hashmi]
4                             [Evening, Shadows]  [Mona, Ambegaonkar]
...                                          ...                  ...
1495                 [Hum, Tumhare, Hain, Sanam]   [Shah, Rukh, Khan]
1496                     [Aankhen, (2002, film)]  [Amitabh, Bachchan]
1497                          [Saathiya, (film)]      [Vivek, Oberoi]
1498                           [Company, (film)]        [Ajay, Devgn]
1499                    [Awara, Paagal, Deewana]      [Akshay, Kumar]

[1500 rows x 2 columns]

In [45]:
sub

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [47]:
sub.apply(lambda x:x[x>100])

     Subscribers gained
35                  123
36                  108
37                  110
45                  126
46                  109
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[240 rows x 1 columns]